Documents/АннулированиеПропуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>АннулированиеПропуска</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПропусков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвиженияПропусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияПропусков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДнейДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИсторияСтатусовПропусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовПропусков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПропусков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
						<v8:Type>cfg:DocumentRef.АннулированиеПропуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/АннулированиеПропуска/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// Установка времени документа
    Если ЭтоНовый() Тогда
        УстановитьВремя(РежимАвтоВремя.НеИспользовать);
        Дата = ТекущаяДатаСеанса();
    КонецЕсли;
    
    Если Дата > ТекущаяДатаСеанса() Тогда
        Сообщить("Дата аннулирования не может быть в будущем!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Пропуск) Тогда
        Сообщить("Поле Пропуск не заполнено!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Инициатор) Тогда
        Сообщить("Поле Ответственный не заполнено!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ДвиженияПропусков.Записывать = Истина;
    
    СообщениеОбОшибке = "";
    Если Не ОбщиеПроверкиПропусков.ПропускНеАннулирован(Пропуск, Ссылка, СообщениеОбОшибке) Тогда
        Сообщить(СообщениеОбОшибке);
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Не ОбщиеПроверкиПропусков.ПропускДействителен(Пропуск, Дата, СообщениеОбОшибке) Тогда
        Сообщить(СообщениеОбОшибке);
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Движение = Движения.ДвиженияПропусков.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход; // Аннулирование - это списание
    Движение.Период = Дата;
    Движение.Пропуск = Пропуск;
    Движение.ФизическоеЛицо = ФизическоеЛицо;
    Движение.Инициатор = Инициатор;
    Движение.КоличествоДнейДействия = 0;
    
    НачатьТранзакцию();
    Попытка
        ПропускОбъект = Пропуск.ПолучитьОбъект();
        Если ПропускОбъект = Неопределено Тогда
            ВызватьИсключение "Пропуск не найден!";
        КонецЕсли;
        
        СтатусАннулирован = Справочники.СтатусыПропусков.НайтиПоНаименованию("Аннулирован", Истина);
        Если НЕ ЗначениеЗаполнено(СтатусАннулирован) Тогда
            ВызватьИсключение "Статус 'Аннулирован' не найден в справочнике СтатусыПропусков!";
        КонецЕсли;
        
        ПропускОбъект.Заблокировать();
        ПропускОбъект.Статус = СтатусАннулирован;
        ПропускОбъект.Записать();
        
        // Запись в регистр сведений ИсторияСтатусовПропусков
        ДвижениеИстории = РегистрыСведений.ИсторияСтатусовПропусков.СоздатьНаборЗаписей();
        ДвижениеИстории.Отбор.Пропуск.Установить(Пропуск);
        ДвижениеИстории.Отбор.Период.Установить(Дата);
        ЗаписьИстории = ДвижениеИстории.Добавить();
        ЗаписьИстории.Пропуск = Пропуск;
        ЗаписьИстории.Период = Дата;
        ЗаписьИстории.Статус = СтатусАннулирован;
        ЗаписьИстории.ДатаНачала = Дата; // Дата начала - дата аннулирования
        ЗаписьИстории.ДатаОкончания = Дата; // Дата окончания - дата аннулирования
        ЗаписьИстории.Ответственный = Инициатор; // Устанавливаем ответственного
        ЗаписьИстории.ДокументОснование = Ссылка;
        ДвижениеИстории.Записать();
        
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        Сообщить("Ошибка при аннулировании пропуска: " + ОписаниеОшибки());
        Отказ = Истина;
	КонецПопытки;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.ДвиженияПропусков.Записывать = Истина;
    Движения.ДвиженияПропусков.Очистить();
    
    СтатусВыдан = Справочники.СтатусыПропусков.НайтиПоНаименованию("Выдан", Истина);
    Если НЕ ЗначениеЗаполнено(СтатусВыдан) Тогда
        Сообщить("Статус 'Выдан' не найден в справочнике СтатусыПропусков!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    НачатьТранзакцию();
    Попытка
        ПропускОбъект = Пропуск.ПолучитьОбъект();
        Если ПропускОбъект <> Неопределено И ПропускОбъект.ДатаОкончания >= ТекущаяДатаСеанса() Тогда
            ПропускОбъект.Заблокировать();
            ПропускОбъект.Статус = СтатусВыдан;
            ПропускОбъект.Записать();
            
            // Запись в регистр сведений ИсторияСтатусовПропусков
            ДвижениеИстории = РегистрыСведений.ИсторияСтатусовПропусков.СоздатьНаборЗаписей();
            ДвижениеИстории.Отбор.Пропуск.Установить(Пропуск);
            ДвижениеИстории.Отбор.Период.Установить(Дата);
            ЗаписьИстории = ДвижениеИстории.Добавить();
            ЗаписьИстории.Пропуск = Пропуск;
            ЗаписьИстории.Период = Дата;
            ЗаписьИстории.Статус = СтатусВыдан;
            ЗаписьИстории.ДатаНачала = ПропускОбъект.ДатаВыдачи; // Восстанавливаем дату начала
            ЗаписьИстории.ДатаОкончания = ПропускОбъект.ДатаОкончания; // Восстанавливаем дату окончания
            ЗаписьИстории.Ответственный = Инициатор;
            ЗаписьИстории.ДокументОснование = Ссылка;
            ЗаписьИстории.Комментарий = "Восстановление статуса после отмены проведения: " + Комментарий;
            ДвижениеИстории.Записать();
        КонецЕсли;
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        Сообщить("Ошибка при восстановлении статуса: " + ОписаниеОшибки());
        Отказ = Истина;
	КонецПопытки;

КонецПроцедуры
